from django.core.management import BaseCommand
from django.db.models import Q

from core.models import Text


class Command(BaseCommand):
    def handle(self, *args, **options):
        texts = [
            ['choose_option', 'Выберите один из вариантов:', 'בחר אחת מהאפשרויות:'],
            ['data_outdated', 'Данные устарели', 'הנתונים התיישנו'],
            ['worker_name', 'Пожалуйста, укажите ваше имя (латинскими буквами)', ''],
            ['input_phone', 'Пожалуйста, укажите контактный номер телефона или воспользуйтесь кнопкой ниже', 'בבקשה ציין את מספר הטלפון שלך או השתמש בכפתור למטה'],
            ['wrong_phone', 'Не похоже на номер телефона, попробуйте еще раз', 'זה לא נראה כמו מספר טלפון, נסה שוב'],
            ['worker_passport_photo', 'Пожалуйста, отправьте читаемую фотографию первой страницы вашего паспорта', ''],
            ['worker_occupations', 'Пожалуйста, выберите профессии, которыми вы владеете, из списка ниже (можно несколько):', ''],
            ['need_occupations', 'Нужно выбрать хотя бы одну профессию', 'צריך לבחור לפחות מקצוע אחד'],
            ['worker_about', 'Пожалуйста, расскажите кратко о себе/рабочих предпочтениях', ''],
            ['worker_min_salary', 'Пожалуйста, укажите минимальную ставку в ₪/час (введите целое число)', ''],
            ['wrong_min_salary', 'Не похоже на ставку в час, должна быть целым числом. Введите минимальную ставку в ₪/час.', 'זה לא נראה כמו תעריף לשעה, הוא צריך להיות מספר שלם. הזן את התעריף המינימלי בש"ח לשעה.'],
            ['need_objects_photo', 'Вы можете добавить фотографии объектов, над которыми работали', ''],
            ['need_more_objects_photo', 'Вы можете добавить еще фотографии объектов, над которыми работали', ''],
            ['worker_objects_photo', 'Пожалуйста, отправьте фотографию объекта, над которым работали', ''],
            ['worker_more_objects_photo', 'Пожалуйста, отправьте еще фотографию объекта, над которым работали. Уже загружено:', ''],
            ['worker_notifications', 'Хотели бы вы получать уведомления о новых вакансиях, подходящих под ваше резюме?', ''],
            ['worker_confirmation', 'Проверьте и подтвердите корректность введенных данных', 'בדוק ואשר את נכונות הנתונים שהוזנו'],
            ['name', 'Имя:', 'שם:'],
            ['phone', 'Номер телефона:', 'מספר טלפון:'],
            ['occupations', 'Профессии:', 'מקצועות:'],
            ['min_salary', 'Ставка от:', 'תעריף החל מ:'],
            ['about', 'О себе:', 'על עצמי:'],
            ['notifications', 'Уведомления:', 'התראות:'],
            ['worker_approved', 'Статус аккаунта:', ''],
            ['search_status', 'В поисках работы:', ''],
            ['worker_profile_error', 'Что-то пошло не так, воспользуйтесь командой /start', ''],
            ['worker_wait_check', 'Дождитесь одобрения вашего резюме администратором', ''],
            ['worker_check_failed', 'Ваше резюме не одобрено администратором, попробуйте заполнить его заново', ''],
            ['your_profile', 'Ваш профиль:', 'הפרופיל שלך:'],
            ['worker_cv_approved', 'Ваше резюме одобрено!', ''],
            ['worker_cv_declined', 'Ваше резюме отклонено, вы можете заполнить его заново', ''],
            ['new_worker', 'Резюме нового работника:', 'קורות חיים של עובד חדש:'],
            ['salary_hourly', '₪/час', 'ש"ח/שעה'],
            ['rating', 'Рейтинг:', 'דירוג:'],
            ['new_worker_interesting', 'Это резюме может вас заинтересовать:', 'קורות חיים אלה עשויים לעניין אותך:'],
            ['saved', 'Данные сохранены', 'הנתונים נשמרו'],
            ['choose_menu_section', 'Выберите раздел меню:', 'בחר סעיף בתפריט:'],
            ['choose_jobs_type', 'Выберите категорию вакансий:', 'בחר קטגוריית משרות:'],
            ['choose_proposals_type', 'Выберите категорию предложений о сотрудничестве:', 'בחר קטגוריית הצעות לשיתוף פעולה:'],
            ['choose_reviews_type', 'Выберите категорию отзывов:', 'בחר קטגוריית חוות דעת:'],
            ['choose_workers_type', 'Выберите категорию работников:', 'בחר קטגוריית עובדים:'],
            ['input_cancel', 'Ввод отменен', 'הזנת הנתונים בוטלה'],
            ['employer_occupations', 'Пожалуйста, выберите каких работников вы ищете (можно выбрать несколько):', 'בבקשה בחר אילו עובדים אתה מחפש (אפשר לבחור כמה):'],
            ['employer_min_salary', 'Пожалуйста, укажите минимальную ставку в ₪/час (введите целое число)', 'בבקשה ציין את התעריף המינימלי בש"ח לשעה (הזן מספר שלם)'],
            ['job_description', 'Пожалуйста, кратко расскажите о работе (место, условия, требования)', 'בבקשה ספר בקצרה על העבודה (מיקום, תנאים, דרישות)'],
            ['employer_notifications', 'Хотели бы вы получать уведомления о новых резюме, подходящих под вакансию?', 'האם תרצה לקבל התראות על קורות חיים חדשים שמתאימים למשרה?'],
            ['description', 'Описание:', 'תיאור:'],
            ['employer_confirmation', 'Проверьте и подтвердите корректность введенных данных', 'בדוק ואשר את נכונות הנתונים שהוזנו'],
            ['job_wait_check', 'Вакансия отправлена на рассмотрение администраторам, мы уведомим о публикации', 'המשרה נשלחה לבדיקה אצל המנהלים, נעדכן אותך עם פרסום'],
            ['new_job', 'Новая вакания:', ''],
            ['new_job_interesting', 'Эта вакансия может вас заинтересовать:', ''],
            ['job_approved', 'Ваша вакансия одобрена', 'המשרה שלך אושרה'],
            ['job_declined', 'Ваша вакансия отклонена', 'המשרה שלכם נדחתה.'],
            ['all_jobs', 'Все вакансии:', 'כל המשרות:'],
            ['jobs_suitable', 'Подходящие вакансии:', 'משרות מתאימות:'],
            ['jobs_active', '✅ Активные вакансии:', '✅ משרות פעילות:'],
            ['jobs_archive', '🗄 Архивные вакансии:', '🗄 משרות בארכיון:'],
            ['jobs_declined', '❌ Отклоненные вакансии:', '❌ משרות נדחות:'],
            ['job_approved_text', 'Статус вакансии:', 'סטטוס המשרה:'],
            ['is_job_active', 'Активна:', 'פעילה:'],
            ['workers_all', 'Все работники:', 'כל העובדים:'],
            ['workers_suitable', 'Подходящие работники:', 'עובדים מתאימים:'],
            ['status', 'Статус:', 'סטטוס:'],
            ['created_at', 'Дата создания:', 'תאריך יצירה:'],
            ['updated_at', 'Дата последнего изменения:', 'תאריך השינוי האחרון:'],
            ['inbox_proposals', '📩 Входящие предложения о сотрудничестве:', '📩 הצעות שיתוף פעולה נכנסות:'],
            ['outbox_proposals', '📤 Исходящие предложения о сотрудничестве:', '📤 הצעות שיתוף פעולה יוצאות:'],
            ['worker', 'Работник:', 'עובד:'],
            ['employer', 'Работодатель:', 'מעסיק:'],
            ['job', 'Вакансия:', 'משרה:'],
            ['jobs', 'Вакансии:', 'משרות פנויות:'],
            ['outbox_proposal', 'Исходящее предложение о сотрудничестве:', 'הצעת שיתוף פעולה יוצאת:'],
            ['inbox_proposal', 'Входящее предложение о сотрудничестве:', 'הצעת שיתוף פעולה נכנסת:'],
            ['new_proposal', 'Вам поступило новое предложение о сотрудничестве', 'קיבלת הצעת שיתוף פעולה חדשה'],
            ['proposal_accepted', 'Ваше предложение о сотрудничестве принято! ✅\nМы свяжемся с вами в ближайшее время.', 'הצעת שיתוף הפעולה שלך התקבלה! ✅\nניצור איתך קשר בקרוב.'],
            ['proposal_declined', 'Ваше предложение о сотрудничестве отклонено ❌', 'הצעת שיתוף הפעולה שלך נדחתה ❌'],
            ['min_min_salary', 'Минимальная ставка от:', ''],
            ['max_min_salary', 'Максимальная ставка от:', ''],
            ['add_rate', 'Поставьте оценку, основанную на вашем опыте сотрудничества.', 'דרג על סמך החוויה שלך בשיתוף הפעולה.'],
            ['add_review', 'Вы можете оставить развернутый отзыв', 'תוכל להשאיר חוות דעת מפורטת'],
            ['add_text_review', 'Отправьте развернутый отзыв', 'שלח חוות דעת מפורטת'],
            ['rate', 'Оценка:', 'דירוג:'],
            ['review', 'Отзыв:', 'חוות דעת:'],
            ['empty', 'не указан', 'לא צוין'],
            ['review_wait_check', 'Дождитесь одобрения вашего отзыва администратором', 'המתן לאישור חוות הדעת שלך על ידי המנהל'],
            ['review_accepted', 'Ваш отзыв одобрен ✅', 'חוות הדעת שלך אושרה ✅'],
            ['review_declined', 'Ваш отзыв отклонен ❌', 'חוות הדעת שלך נדחתה ❌'],
            ['review_new', 'Вы получили новый отзыв 💬', 'קיבלת חוות דעת חדשה 💬'],
            ['inbox_reviews', '📩 Полученные отзывы:', '📩 חוות דעת שהתקבלו'],
            ['outbox_reviews', '📤 Отправленные отзывы:', '📤 חוות דעת שנשלחו'],
            ['inbox_review', '📩 Полученный отзыв:', '📩 חוות דעת שהתקבלה:'],
            ['outbox_review', '📤 Отправленный отзыв:', '📤 חוות דעת שנשלחה:'],
            ['rating_employer', 'Рейтинг работодателя:', 'דירוג המעסיק:'],
            ['rating_worker', 'Рейтинг работника:', 'דירוג העובד:'],
            ['error_input', 'Ввод данной информации не ожидается, попробуйте воспользоваться командой /start', 'הזנת מידע זה אינה צפויה, נסה להשתמש בפקודה /start'],
            ['keyboard_outdated', 'Данные устарели. Вы можете воспользоваться командой /start.', 'הנתונים מיושנים. תוכל להשתמש בפקודה /start.'],
            ['employer_company_name', 'Имя/название компании:', 'שם/שם החברה:'],
            ['input_employer_name', 'Пожалуйста, укажите ваше имя или название компании', 'אנא ציין את שמך או את שם החברה שלך.'],
        ]
        
        for item in texts:
            slug = item[0]
            text_rus = item[1]
            text_heb = item[2]

            prev_text = Text.objects.filter(slug=slug).first()
            if not prev_text:
                my_order = Text.objects.count()
                new_text = Text(slug=slug, rus=text_rus, heb=text_heb, my_order=my_order)
                new_text.save()
                print(f'Создан текст {slug}: {text_rus}\n{text_heb}')
            else:
                if prev_text.rus != text_rus:
                    prev_text.rus = text_rus
                    prev_text.save()
                    print(text_rus)
                    print(prev_text.rus)
                    print(f'{slug}: заменен русский текст')

                if prev_text.heb != text_heb:
                    prev_text.heb = text_heb
                    prev_text.save()
                    print(f'{slug}: заменен текст на иврите')
        
        print('done')

